In [3]:
from datascience import *
import numpy as np
## Normal Distribution
%matplotlib inline
import matplotlib.pyplot as plt
plt.style.use('fivethirtyeight')
from IPython.display import Image
from IPython.core.display import HTML 
from mpl_toolkits.mplot3d import Axes3D

In [4]:
a = True
b = False
c = True

if (a and b):
    print("First")
elif ((b or c) and not(a)):
    print("Second")
if (not c or not a):
    print ("Third")

In [5]:
for i in make_array(1,2,3,4,5):
    i=i+3
    print(i*2)

8
10
12
14
16

In [8]:
for i in make_array(1,2,3,4,5):
    print(i)
    i=i+3
    print(i)
    print(i*2)
    print("-------")

1
4
8
-------
2
5
10
-------
3
6
12
-------
4
7
14
-------
5
8
16
-------

In [7]:
for i in make_array(1,2,3,4,5):
    i=i+3
    print("Hey!")

Hey!
Hey!
Hey!
Hey!
Hey!

In [10]:
def hungry_adder(a, b):
    return a+b
    print("Thanks for feeding me those tasty numbers!")
    
hungry_adder(4, 5)

9

In [11]:
students = Table().with_columns("StudentId", [12345, 67890, 67890], "Class", ["cse12", "cse12", "cse21"], "GPA", [3.3, 2.3, 3.5])
students

StudentId | Class | GPA
12345     | cse12 | 3.3
67890     | cse12 | 2.3
67890     | cse21 | 3.5

In [12]:
prof = Table().with_columns( "Course", ["cse12", "cse21"], "Prof", ["Alvarado", "Jones"])
prof

Course | Prof
cse12  | Alvarado
cse21  | Jones

In [13]:
students.join("Class", prof, "Course")

Class | StudentId | GPA  | Prof
cse12 | 12345     | 3.3  | Alvarado
cse12 | 67890     | 2.3  | Alvarado
cse21 | 67890     | 3.5  | Jones

In [14]:
prof.join("Course", students, "Class")

Course | Prof     | StudentId | GPA
cse12  | Alvarado | 12345     | 3.3
cse12  | Alvarado | 67890     | 2.3
cse21  | Jones    | 67890     | 3.5

In [16]:
students.group("Class", max)

Class | StudentId max | GPA max
cse12 | 67890         | 3.3
cse21 | 67890         | 3.5

Can you conclude that student 67890 has a 3.3 GPA in CSE12 and a 3.5 GPA in CSE21?